### **Client_api**

<a href="./#client_api" style="height:50px;width:35px;position:fixed;bottom:100px;right:0px;background:#00BCC1;opacity:0.6;color:#333;text-decoration:none;">回到顶部</a>

### 测试主机host: 47.103.61.179:1022/  
- [user模块](./#user模块)  
    - [获取短信验证码](./#获取短信验证码)  
    - [获取access_token](./#获取access_token)
    - [获取用户信息接口](./#获取用户信息)   
    - 上传用户头像  
    	先调用[上传图片](./#上传图片接口)的接口,再调用[更新用户信息](./#更新用户信息)的接口
    - [更新用户信息](./#更新用户信息)  
    - [检查是否绑定](./#检查是否绑定微信qq)
    - 绑定微信qq  
    	参考[更新用户信息](./#更新用户信息)的接口
    - [主页浏览](./#主页浏览)
        - [新增主页浏览记录](./#新增主页浏览记录)
	- 查看今日,历史浏览人数  
		参考[获取用户信息接口](./#获取用户信息)接口
    - [我的收藏](./#我的收藏)
    - [历史记录](./#历史记录)
    - [举报用户或群](./#举报用户或群)
    - [拉黑用户](./#拉黑用户)
    - [检查重复手机号](./#检查重复手机号)   
- [搜索](./#搜索)
    - [综合搜索](./#综合搜索) 
    - [文章搜索](./#文章搜索)
    - [用户搜索](./#用户搜索)
    - [电台搜索](./#电台搜索)   
    - [创业邦搜索](./#创业邦搜索)  
- [通用模块](./#通用模块)
	- [用户反馈](./#用户反馈)
	- [上报设备号](./#上报设备号)  
	- [上传图片接口](./#上传图片接口)
	- [get贷超url](./#get贷超url)
	- [客户端上传文件到oss](./#客户端上传文件到oss)
	- [检测手机号](./#检测手机号)  
	- [ios审核](./#ios审核)
- [app相关](./#app相关)
    - [app版本更新](./#app版本更新)
    - [app工作url](./#app工作url)
- [banner模块](./#banner模块)
    - [获取banner图片](./#获取banner图片)
- [文章模块](./#文章模块)
    - [获取首页文章列表](./#获取首页文章列表)
    - [文章详情](./#文章详情)
    - [文章详情中的评论接口 没有点进去的](./#文章评论)
    - [文章点赞收藏关注toggle](./#文章点赞收藏关注toggle)
    - [添加文章评论](./#添加文章评论)
    - [删除评论](./#删除评论)
    - [更多评论点进去的最新评论](./#更多评论点进去的最新评论)
    - [更多评论点进去的最热评论](./#更多评论点进去的最热评论)
    - [评论点赞toggle](./#评论点赞toggle)
    - [评论详情](./#评论详情)
    - [举报文章](./#举报文章)
    - [专题列表](./#专题列表)
    - [专题详情](./#专题详情)    
    - [专题好文列表](./#专题好文列表)
    - [专题订阅和取消订阅](./#专题订阅和取消订阅)    
- [活动模块](./#活动模块)
    - [活动列表](./#活动列表)
    - [活动详情](./#活动详情)
    - [活动报名提交](./#活动报名提交)
    - [检测是否已经报名](./#检测是否已经报名)
    - [我的门票](./#我的门票)
- [优选模块](./#优选模块)
    - [通知数](./#通知数)
    - [通知列表](./#通知列表)    
    - [动态列表](./#动态列表)
    - [新增粉丝列表](./#新增粉丝列表)
    - [更新设备device_tokens](./#更新设备device_tokens) 
    - [通知透传](./#通知透传)   
- [创业模块](./#创业模块)
    - [创业首页列表](./#创业首页列表)
    - [创业内页列表](./#创业内页列表)
    - [城市搜索列表](./#城市搜索列表)
    - [创业类型列表](./#创业类型列表)
    - [热门城市列表](./#热门城市列表)
    - [创业背景图列表](./#创业背景图列表)
    - [创业发布](./#创业发布)
    - [创业首页轮播图](./#创业首页轮播图)
    - [举报创业邦](./#举报创业邦)    
    - [和我聊聊](./#和我聊聊)    
- [我的](./#我的)
    - [信息](./#信息)
    - [发布的文章](./#发布的文章)   
    - [我的创业邦](./#我的创业邦)
    - [我的订阅](./#我的订阅)     
    - [通知消息设置](./#通知消息设置)    
    - [建议和反馈](./#建议和反馈)    
    - [编辑个人资料](./#编辑个人资料)
    - [关注作者](./#关注作者)  
    - [ta的关注和粉丝](./#ta的关注和粉丝)       
- [电台](./#电台)
    - [电台列表](./#电台列表)
    - [电台列表详情](./#电台列表详情)    
    - [电台点赞](./#电台点赞)
    - [电台收藏](./#电台收藏)    
    - [电台列表内页的评论](./#电台列表内页的评论)     
    - [电台最新评论](./#电台最新评论)     
    - [电台最热评论](./#电台最热评论)         
    - [电台评论详情](./#电台评论详情)   
    - [电台评论点赞](./#电台评论点赞)        
    - [电台post评论](./#电台post评论)
    - [电台举报](./#电台举报)     
    - [电台时间轴](./#电台时间轴)   
    - [电台banner](./#电台banner)   
    - [我的电台](./#我的电台)  
    - [电台标题搜索](./#电台标题搜索)
    - [电台评论个数](./#电台评论个数)    
- [赚钱圈](./#赚钱圈)
    - [领域列表](./#领域列表)
    - [圈子创建](./#圈子创建)    
    - [圈子修改](./#圈子修改)
    - [圈子信息](./#圈子信息)    
    - [圈子删除](./#圈子删除)      
    - [圈子列表](./#圈子列表)      
    - [聊天点赞](./#聊天点赞)      
    - [聊天点赞查询](./#聊天点赞查询)      
    - [根据第三方用户id查询用户信息](./#根据第三方用户id查询用户信息)      
    - [圈子成员新增](./#圈子成员新增)      
    - [圈子成员删除](./#圈子成员删除)      
    - [圈子成员列表](./#圈子成员列表)      
    - [用户信息查询](./#用户信息查询)          
    - [名片列表](./#名片列表)              
    - [名片新增](./#名片新增)         
    - [名片修改](./#名片修改)         
    - [名片删除](./#名片删除)         
    - [更改群主](./#更改群主)         
    - [小报当日数量统计](./#小报当日数量统计)         
    - [小报列表](./#小报列表)         
    - [赚钱圈banner](./#赚钱圈banner)         
    - [赚钱圈圈子信息](./#赚钱圈圈子信息)         
    - [个人中心我/他的圈子](./#个人中心我/他的圈子)       
- [权益](./#权益)
    - [权益列表](./#权益列表)   
    - [权益购买](./#权益购买)   
    - [权益使用](./#权益使用)   
    - [我的权益](./#我的权益)   
    - [权益信息](./#权益信息)   
    
### 全局header  

key |  vaule
----- | --------
Accept | application/json
Content-Type | application/json

需要验证的接口加上:  
  
key |  vaule
----- | --------
Authorization | Bearer ***access_token***  



## user模块

### 获取短信验证码
- 请求方式: `post`
- 请求地址: {host}`get-sms-code`
- 请求参数:  

```json
{
    "mobile": 15821827706
}
```  
- 响应内容:  

```json
{
    "code": 1,
    "message": "获取成功",
    "info": ""
}
```

### 获取access_token
- 请求方式: `post`
- 请求地址: {host}`get-access-token`
- 请求参数:  

```json
{
    "mobile": 15821827706, 
    "sms_code": 5934,
}
```  
- 响应内容:  

```json
{
    "code": 1,
    "message": "success",
    "info": {
        "access_token": "uFYrhY7NUj68X9K_EbAFJ6axpWJVY70E"
    }
}
```
